; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-4-28)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-8 - location
	p1-3 - location
	p3-0 - location
	p3-2 - location
	p3-5 - location
	p3-9 - location
	p4-9 - location
	p5-1 - location
	p5-6 - location
	p5-7 - location
	p7-2 - location
	p7-3 - location
	p8-2 - location
	p8-3 - location
	p8-4 - location
	p9-2 - location
	p9-8 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s9)
	(at driver3 s9)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s7)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s8)
	(empty truck4)
	(at package1 s5)
	(at package2 s3)
	(at package3 s1)
	(at package4 s2)
	(at package5 s1)
	(at package6 s5)
	(at package7 s4)
	(at package8 s7)
	(at package9 s0)
	(at package10 s4)
	(at package11 s2)
	(at package12 s0)
	(at package13 s3)
	(at package14 s1)
	(at package15 s5)
	(at package16 s3)
	(at package17 s3)
	(at package18 s7)
	(at package19 s1)
	(at package20 s5)
	(at package21 s2)
	(at package22 s9)
	(at package23 s3)
	(at package24 s4)
	(at package25 s9)
	(at package26 s8)
	(at package27 s8)
	(at package28 s5)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(link s0 s6)
	(link s6 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s4)
	(link s4 s1)
	(link s1 s8)
	(link s8 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s7)
	(link s7 s2)
	(link s2 s9)
	(link s9 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s5)
	(link s5 s4)
	(link s4 s6)
	(link s6 s4)
	(link s4 s8)
	(link s8 s4)
	(link s4 s9)
	(link s9 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s7)
	(link s7 s5)
	(link s5 s9)
	(link s9 s5)
	(link s6 s3)
	(link s3 s6)
	(link s6 s5)
	(link s5 s6)
	(link s7 s1)
	(link s1 s7)
	(link s8 s0)
	(link s0 s8)
	(link s8 s2)
	(link s2 s8)
	(link s8 s6)
	(link s6 s8)
	(link s9 s6)
	(link s6 s9)
	(link s9 s7)
	(link s7 s9)
	(link s9 s8)
	(link s8 s9)
)
	(:goal (and
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s2)
	(at truck2 s1)
	(at truck3 s9)
	(at truck4 s2)
	(at package1 s0)
	(at package2 s6)
	(at package3 s8)
	(at package4 s3)
	(at package5 s2)
	(at package6 s1)
	(at package7 s7)
	(at package8 s4)
	(at package9 s9)
	(at package10 s8)
	(at package11 s3)
	(at package12 s6)
	(at package13 s8)
	(at package14 s1)
	(at package15 s3)
	(at package17 s3)
	(at package18 s0)
	(at package19 s0)
	(at package21 s7)
	(at package22 s8)
	(at package23 s1)
	(at package25 s7)
	(at package26 s1)
	(at package27 s5)
	(at package28 s2)
	))


)

; plan
1. (board-truck driver1 s5 truck3)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 2 of 31
2. (load-truck s5 package6 truck3)
   deleted: (at package6 s5)
   added: (in package6 truck3)
   goals met: 2 of 31
3. (drive-truck driver1 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 2 of 31
4. (load-truck s2 package4 truck3)
   deleted: (at package4 s2)
   added: (in package4 truck3)
   goals met: 2 of 31
5. (load-truck s2 package21 truck3)
   deleted: (at package21 s2)
   added: (in package21 truck3)
   goals met: 2 of 31
6. (drive-truck driver1 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 2 of 31
7. (load-truck s5 package28 truck3)
   deleted: (at package28 s5)
   added: (in package28 truck3)
   goals met: 2 of 31
8. (drive-truck driver1 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 2 of 31
9. (unload-truck s2 package28 truck3)
   deleted: (in package28 truck3)
   added: (at package28 s2)
   goals met: 3 of 31
10. (drive-truck driver1 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 3 of 31
11. (unload-truck s1 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s1)
   goals met: 4 of 31
12. (drive-truck driver1 s1 s7 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   goals met: 4 of 31
13. (load-truck s7 package8 truck3)
   deleted: (at package8 s7)
   added: (in package8 truck3)
   goals met: 4 of 31
14. (drive-truck driver1 s7 s1 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   goals met: 4 of 31
15. (load-truck s1 package5 truck3)
   deleted: (at package5 s1)
   added: (in package5 truck3)
   goals met: 4 of 31
16. (drive-truck driver1 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 4 of 31
17. (drive-truck driver1 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 4 of 31
18. (load-truck s5 package15 truck3)
   deleted: (at package15 s5)
   added: (in package15 truck3)
   goals met: 4 of 31
19. (load-truck s5 package1 truck3)
   deleted: (at package1 s5)
   added: (in package1 truck3)
   goals met: 4 of 31
20. (walk driver2 s9 p4-9)
   deleted: (at driver2 s9)
   added: (at driver2 p4-9)
   goals met: 4 of 31
21. (walk driver2 p4-9 s4)
   deleted: (at driver2 p4-9)
   added: (at driver2 s4)
   goals met: 5 of 31
22. (walk driver3 s9 p9-2)
   deleted: (at driver3 s9)
   added: (at driver3 p9-2)
   goals met: 5 of 31
23. (walk driver3 p9-2 s2)
   deleted: (at driver3 p9-2)
   added: (at driver3 s2)
   goals met: 6 of 31
24. (drive-truck driver1 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 6 of 31
25. (drive-truck driver1 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 6 of 31
26. (load-truck s1 package3 truck3)
   deleted: (at package3 s1)
   added: (in package3 truck3)
   goals met: 6 of 31
27. (drive-truck driver1 s1 s8 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s8)
   goals met: 6 of 31
28. (unload-truck s8 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s8)
   goals met: 7 of 31
29. (load-truck s8 package27 truck3)
   deleted: (at package27 s8)
   added: (in package27 truck3)
   goals met: 7 of 31
30. (drive-truck driver1 s8 s2 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   goals met: 7 of 31
31. (drive-truck driver1 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 7 of 31
32. (unload-truck s5 package27 truck3)
   deleted: (in package27 truck3)
   added: (at package27 s5)
   goals met: 8 of 31
33. (walk driver3 s2 p8-2)
   deleted: (at driver3 s2)
   added: (at driver3 p8-2)
   goals met: 7 of 31
34. (load-truck s8 package26 truck4)
   deleted: (at package26 s8)
   added: (in package26 truck4)
   goals met: 7 of 31
35. (walk driver3 p8-2 s8)
   deleted: (at driver3 p8-2)
   added: (at driver3 s8)
   goals met: 7 of 31
36. (board-truck driver3 s8 truck4)
   deleted: (at driver3 s8) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 7 of 31
37. (drive-truck driver3 s8 s2 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s2)
   goals met: 8 of 31
38. (load-truck s2 package11 truck4)
   deleted: (at package11 s2)
   added: (in package11 truck4)
   goals met: 8 of 31
39. (drive-truck driver3 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 7 of 31
40. (drive-truck driver1 s5 s7 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   goals met: 7 of 31
41. (unload-truck s7 package21 truck3)
   deleted: (in package21 truck3)
   added: (at package21 s7)
   goals met: 8 of 31
42. (load-truck s7 package18 truck3)
   deleted: (at package18 s7)
   added: (in package18 truck3)
   goals met: 8 of 31
43. (unload-truck s1 package26 truck4)
   deleted: (in package26 truck4)
   added: (at package26 s1)
   goals met: 9 of 31
44. (load-truck s1 package19 truck4)
   deleted: (at package19 s1)
   added: (in package19 truck4)
   goals met: 9 of 31
45. (drive-truck driver1 s7 s2 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   goals met: 9 of 31
46. (unload-truck s2 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s2)
   goals met: 10 of 31
47. (drive-truck driver1 s2 s7 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   goals met: 10 of 31
48. (drive-truck driver3 s1 s3 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   goals met: 10 of 31
49. (drive-truck driver1 s7 s5 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   goals met: 10 of 31
50. (load-truck s3 package23 truck4)
   deleted: (at package23 s3)
   added: (in package23 truck4)
   goals met: 10 of 31
51. (load-truck s3 package2 truck4)
   deleted: (at package2 s3)
   added: (in package2 truck4)
   goals met: 10 of 31
52. (drive-truck driver3 s3 s6 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s6)
   goals met: 10 of 31
53. (drive-truck driver3 s6 s0 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s0)
   goals met: 10 of 31
54. (load-truck s0 package9 truck4)
   deleted: (at package9 s0)
   added: (in package9 truck4)
   goals met: 10 of 31
55. (unload-truck s0 package19 truck4)
   deleted: (in package19 truck4)
   added: (at package19 s0)
   goals met: 11 of 31
56. (drive-truck driver3 s0 s2 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   goals met: 12 of 31
57. (drive-truck driver3 s2 s9 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s9)
   goals met: 11 of 31
58. (unload-truck s9 package9 truck4)
   deleted: (in package9 truck4)
   added: (at package9 s9)
   goals met: 12 of 31
59. (load-truck s9 package25 truck4)
   deleted: (at package25 s9)
   added: (in package25 truck4)
   goals met: 12 of 31
60. (drive-truck driver3 s9 s2 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s2)
   goals met: 13 of 31
61. (drive-truck driver3 s2 s7 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s7)
   goals met: 12 of 31
62. (unload-truck s7 package25 truck4)
   deleted: (in package25 truck4)
   added: (at package25 s7)
   goals met: 13 of 31
63. (drive-truck driver3 s7 s0 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s0)
   goals met: 13 of 31
64. (load-truck s0 package12 truck4)
   deleted: (at package12 s0)
   added: (in package12 truck4)
   goals met: 13 of 31
65. (drive-truck driver3 s0 s2 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   goals met: 14 of 31
66. (drive-truck driver3 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 13 of 31
67. (drive-truck driver3 s1 s3 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   goals met: 13 of 31
68. (load-truck s3 package13 truck4)
   deleted: (at package13 s3)
   added: (in package13 truck4)
   goals met: 13 of 31
69. (drive-truck driver3 s3 s1 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   goals met: 13 of 31
70. (drive-truck driver3 s1 s8 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s8)
   goals met: 13 of 31
71. (unload-truck s8 package13 truck4)
   deleted: (in package13 truck4)
   added: (at package13 s8)
   goals met: 14 of 31
72. (drive-truck driver3 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 14 of 31
73. (unload-truck s1 package23 truck4)
   deleted: (in package23 truck4)
   added: (at package23 s1)
   goals met: 15 of 31
74. (drive-truck driver3 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 16 of 31
75. (drive-truck driver3 s2 s5 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   goals met: 15 of 31
76. (drive-truck driver1 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 15 of 31
77. (unload-truck s4 package8 truck3)
   deleted: (in package8 truck3)
   added: (at package8 s4)
   goals met: 16 of 31
78. (drive-truck driver1 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 16 of 31
79. (drive-truck driver1 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 16 of 31
80. (unload-truck s3 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s3)
   goals met: 17 of 31
81. (drive-truck driver1 s3 s5 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   goals met: 17 of 31
82. (drive-truck driver1 s5 s7 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   goals met: 17 of 31
83. (drive-truck driver3 s5 s6 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   goals met: 17 of 31
84. (unload-truck s6 package2 truck4)
   deleted: (in package2 truck4)
   added: (at package2 s6)
   goals met: 18 of 31
85. (drive-truck driver3 s6 s9 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   goals met: 18 of 31
86. (load-truck s9 package22 truck4)
   deleted: (at package22 s9)
   added: (in package22 truck4)
   goals met: 18 of 31
87. (drive-truck driver3 s9 s8 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s8)
   goals met: 18 of 31
88. (unload-truck s8 package22 truck4)
   deleted: (in package22 truck4)
   added: (at package22 s8)
   goals met: 19 of 31
89. (drive-truck driver3 s8 s4 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s4)
   goals met: 19 of 31
90. (load-truck s4 package7 truck4)
   deleted: (at package7 s4)
   added: (in package7 truck4)
   goals met: 19 of 31
91. (drive-truck driver3 s4 s6 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s6)
   goals met: 19 of 31
92. (drive-truck driver3 s6 s9 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   goals met: 19 of 31
93. (drive-truck driver3 s9 s2 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s2)
   goals met: 20 of 31
94. (drive-truck driver3 s2 s5 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   goals met: 19 of 31
95. (drive-truck driver1 s7 s0 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   goals met: 19 of 31
96. (drive-truck driver1 s0 s6 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   goals met: 19 of 31
97. (drive-truck driver3 s5 s7 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   goals met: 19 of 31
98. (unload-truck s7 package7 truck4)
   deleted: (in package7 truck4)
   added: (at package7 s7)
   goals met: 20 of 31
99. (drive-truck driver3 s7 s2 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s2)
   goals met: 21 of 31
100. (drive-truck driver3 s2 s5 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   goals met: 20 of 31
101. (drive-truck driver1 s6 s0 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   goals met: 20 of 31
102. (unload-truck s0 package18 truck3)
   deleted: (in package18 truck3)
   added: (at package18 s0)
   goals met: 21 of 31
103. (drive-truck driver1 s0 s6 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   goals met: 21 of 31
104. (drive-truck driver1 s6 s3 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   goals met: 21 of 31
105. (unload-truck s3 package15 truck3)
   deleted: (in package15 truck3)
   added: (at package15 s3)
   goals met: 22 of 31
106. (drive-truck driver1 s3 s5 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   goals met: 22 of 31
107. (drive-truck driver1 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 22 of 31
108. (load-truck s4 package10 truck3)
   deleted: (at package10 s4)
   added: (in package10 truck3)
   goals met: 22 of 31
109. (drive-truck driver1 s4 s8 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s8)
   goals met: 22 of 31
110. (unload-truck s8 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s8)
   goals met: 23 of 31
111. (drive-truck driver1 s8 s9 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s9)
   goals met: 24 of 31
112. (drive-truck driver1 s9 s5 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s5)
   goals met: 23 of 31
113. (drive-truck driver1 s5 s7 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   goals met: 23 of 31
114. (drive-truck driver3 s5 s3 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   goals met: 23 of 31
115. (unload-truck s3 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s3)
   goals met: 24 of 31
116. (drive-truck driver3 s3 s5 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   goals met: 24 of 31
117. (drive-truck driver3 s5 s2 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s2)
   goals met: 25 of 31
118. (drive-truck driver1 s7 s0 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   goals met: 25 of 31
119. (unload-truck s0 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s0)
   goals met: 26 of 31
120. (drive-truck driver1 s0 s7 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   goals met: 26 of 31
121. (disembark-truck driver1 s7 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s7) (empty truck3)
   goals met: 26 of 31
122. (board-truck driver1 s7 truck2)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 26 of 31
123. (drive-truck driver1 s7 s1 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   goals met: 27 of 31
124. (disembark-truck driver1 s1 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 27 of 31
125. (walk driver1 s1 p5-1)
   deleted: (at driver1 s1)
   added: (at driver1 p5-1)
   goals met: 27 of 31
126. (walk driver1 p5-1 s5)
   deleted: (at driver1 p5-1)
   added: (at driver1 s5)
   goals met: 28 of 31
127. (drive-truck driver3 s2 s9 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s9)
   goals met: 27 of 31
128. (drive-truck driver3 s9 s6 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s6)
   goals met: 27 of 31
129. (unload-truck s6 package12 truck4)
   deleted: (in package12 truck4)
   added: (at package12 s6)
   goals met: 28 of 31
130. (drive-truck driver3 s6 s9 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s9)
   goals met: 28 of 31
131. (drive-truck driver3 s9 s2 truck4)
   deleted: (at truck4 s9)
   added: (at truck4 s2)
   goals met: 29 of 31
132. (disembark-truck driver3 s2 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 30 of 31
133. (walk driver3 s2 p7-2)
   deleted: (at driver3 s2)
   added: (at driver3 p7-2)
   goals met: 29 of 31
134. (walk driver3 p7-2 s7)
   deleted: (at driver3 p7-2)
   added: (at driver3 s7)
   goals met: 29 of 31
135. (board-truck driver3 s7 truck3)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 29 of 31
136. (drive-truck driver3 s7 s2 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   goals met: 29 of 31
137. (drive-truck driver3 s2 s9 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   goals met: 30 of 31
138. (disembark-truck driver3 s9 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s9) (empty truck3)
   goals met: 30 of 31
139. (walk driver3 s9 p9-2)
   deleted: (at driver3 s9)
   added: (at driver3 p9-2)
   goals met: 30 of 31
140. (walk driver3 p9-2 s2)
   deleted: (at driver3 p9-2)
   added: (at driver3 s2)
   goals met: 31 of 31
